# Introduccion a Pandas

In [1]:
import numpy as np
import pandas as pd

## Series

### Con listas

In [2]:
pd.Series(['elemento1', 'elemento2', 'elemento3'])

0    elemento1
1    elemento2
2    elemento3
dtype: object

In [3]:
pd.Series(['enlista1', 'elemento2', 'elemento3']).index

RangeIndex(start=0, stop=3, step=1)

In [4]:
pd.Series(['enlista1', 'enlista2', 'enlista3'], ['indice1', 'indice2', 'indice3'])

indice1    enlista1
indice2    enlista2
indice3    enlista3
dtype: object

In [5]:
pd.Series(['enlista1', 'enlista2', 'enlista3'], ['indice1', 'indice2', 'indice3']).index

Index(['indice1', 'indice2', 'indice3'], dtype='object')

### Con Tuplas

In [6]:
pd.Series((1,2,3))

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series((1,2,3), ('a','b','c'))

a    1
b    2
c    3
dtype: int64

### Con arrays

In [8]:
pd.Series(np.array([1,2,3]))

0    1
1    2
2    3
dtype: int32

In [9]:
pd.Series(np.array(['enlista1', 'elemento2', 'elemento3']), np.array(['indice1', 'indice2', 'indice3']))

indice1     enlista1
indice2    elemento2
indice3    elemento3
dtype: object

### Con diccionarios

In [10]:
pd.Series({'a':1, 'b':2, 'c':3})

a    1
b    2
c    3
dtype: int64

### Puede almacenar diferentes objetos

In [11]:
pd.Series(['a', 1, 1.2, [1,2,3], {5,4,6}, (7,8,9), len])

0                          a
1                          1
2                        1.2
3                  [1, 2, 3]
4                  {4, 5, 6}
5                  (7, 8, 9)
6    <built-in function len>
dtype: object

### Operaciones

In [12]:
s1 = pd.Series([1, 2, 3], ['indice1', 'indice2', 'indice3'])

In [13]:
s2 = pd.Series([1, 2, 3], ['indice1', 'indice2', 'indice3'])

In [14]:
s1

indice1    1
indice2    2
indice3    3
dtype: int64

In [15]:
s2

indice1    1
indice2    2
indice3    3
dtype: int64

In [16]:
s1 + s2

indice1    2
indice2    4
indice3    6
dtype: int64

In [17]:
s1-s2

indice1    0
indice2    0
indice3    0
dtype: int64

In [18]:
s1*s2

indice1    1
indice2    4
indice3    9
dtype: int64

In [19]:
s1/s2

indice1    1.0
indice2    1.0
indice3    1.0
dtype: float64

In [20]:
s1**s2

indice1     1
indice2     4
indice3    27
dtype: int64

In [21]:
s3 = pd.Series([0, 2, 3], ['indice1', 'indice2', 'indice3'])

In [22]:
s3

indice1    0
indice2    2
indice3    3
dtype: int64

In [23]:
s1/s3

indice1    inf
indice2    1.0
indice3    1.0
dtype: float64

In [24]:
s3/s3

indice1    NaN
indice2    1.0
indice3    1.0
dtype: float64

In [25]:
s1+2

indice1    3
indice2    4
indice3    5
dtype: int64

In [26]:
s1*2

indice1    2
indice2    4
indice3    6
dtype: int64

In [27]:
s1/0

indice1    inf
indice2    inf
indice3    inf
dtype: float64

In [28]:
s3/0

indice1    NaN
indice2    inf
indice3    inf
dtype: float64

In [29]:
s4 = pd.Series([1, 2, 3], ['indice4', 'indice2', 'indice3'])

In [30]:
s1+s4

indice1    NaN
indice2    4.0
indice3    6.0
indice4    NaN
dtype: float64

## Dataframes

In [31]:
d = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [32]:
d

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
d = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], ['fila1', 'fila2', 'fila3'], ['columna1', 'columna2', 'columna3'])

In [34]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

In [35]:
d.index

Index(['fila1', 'fila2', 'fila3'], dtype='object')

In [36]:
d.columns

Index(['columna1', 'columna2', 'columna3'], dtype='object')

In [37]:
dic = {'columna1': [1,4,7], 'columna2': [2,5,8], 'columna3': [3,6,9]}
dic

{'columna1': [1, 4, 7], 'columna2': [2, 5, 8], 'columna3': [3, 6, 9]}

In [38]:
pd.DataFrame(dic)

   columna1  columna2  columna3
0         1         2         3
1         4         5         6
2         7         8         9

In [39]:
d.reset_index()

   index  columna1  columna2  columna3
0  fila1         1         2         3
1  fila2         4         5         6
2  fila3         7         8         9

In [40]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

In [41]:
d.index = [0,1,2]

In [42]:
d

   columna1  columna2  columna3
0         1         2         3
1         4         5         6
2         7         8         9

In [43]:
d.index = ['fila1', 'fila2', 'fila3']

In [44]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

### Columnas

In [45]:
d['columna1']

fila1    1
fila2    4
fila3    7
Name: columna1, dtype: int64

In [46]:
d['columna2']

fila1    2
fila2    5
fila3    8
Name: columna2, dtype: int64

In [47]:
type(d['columna2'])

pandas.core.series.Series

In [48]:
d[['columna1', 'columna3']]

       columna1  columna3
fila1         1         3
fila2         4         6
fila3         7         9

In [49]:
d['columna4'] = pd.Series([7,8,9], ['fila1', 'fila2', 'fila3'])

In [50]:
d

       columna1  columna2  columna3  columna4
fila1         1         2         3         7
fila2         4         5         6         8
fila3         7         8         9         9

In [51]:
d.drop('columna4', axis = 1)

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

In [52]:
d

       columna1  columna2  columna3  columna4
fila1         1         2         3         7
fila2         4         5         6         8
fila3         7         8         9         9

In [53]:
d.drop(['columna1', 'columna2'], axis = 1)

       columna3  columna4
fila1         3         7
fila2         6         8
fila3         9         9

In [54]:
d

       columna1  columna2  columna3  columna4
fila1         1         2         3         7
fila2         4         5         6         8
fila3         7         8         9         9

In [55]:
d.drop('columna4', axis = 1, inplace = True)

In [56]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

### Filas

In [57]:
d.loc['fila1']

columna1    1
columna2    2
columna3    3
Name: fila1, dtype: int64

In [58]:
d.loc[['fila1', 'fila2']]

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6

In [59]:
d.loc[:,'columna1']

fila1    1
fila2    4
fila3    7
Name: columna1, dtype: int64

In [60]:
d.loc[:,['columna1', 'columna2']]

       columna1  columna2
fila1         1         2
fila2         4         5
fila3         7         8

In [61]:
d.loc[['fila1', 'fila3'], ['columna1', 'columna3']]

       columna1  columna3
fila1         1         3
fila3         7         9

In [62]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

In [63]:
d.iloc[0,0]

1

In [64]:
d.iloc[1,2]

6

In [65]:
d.iloc[0:2,1:3]

       columna2  columna3
fila1         2         3
fila2         5         6

In [66]:
d

       columna1  columna2  columna3
fila1         1         2         3
fila2         4         5         6
fila3         7         8         9

In [67]:
d>4

       columna1  columna2  columna3
fila1     False     False     False
fila2     False      True      True
fila3      True      True      True

In [68]:
d[d>4]

       columna1  columna2  columna3
fila1       NaN       NaN       NaN
fila2       NaN       5.0       6.0
fila3       7.0       8.0       9.0

In [69]:
d['columna2']>4

fila1    False
fila2     True
fila3     True
Name: columna2, dtype: bool

In [70]:
d[d['columna2']>4]

       columna1  columna2  columna3
fila2         4         5         6
fila3         7         8         9

In [71]:
d>2

       columna1  columna2  columna3
fila1     False     False      True
fila2      True      True      True
fila3      True      True      True

In [72]:
d<9

       columna1  columna2  columna3
fila1      True      True      True
fila2      True      True      True
fila3      True      True     False

In [73]:
(d>2) & (d<9)

       columna1  columna2  columna3
fila1     False     False      True
fila2      True      True      True
fila3      True      True     False

In [74]:
(d<2) | (d>8)

       columna1  columna2  columna3
fila1      True     False     False
fila2     False     False     False
fila3     False     False      True

## Multi-Indices

In [75]:
ind = [('a',1), ('a',2), ('a',3), ('b',4), ('b',5), ('b',6)]
mi = pd.MultiIndex.from_tuples(ind)

In [76]:
type(mi)

pandas.core.indexes.multi.MultiIndex

In [77]:
d = pd.DataFrame(np.random.randint(0,100,36).reshape(6,6), mi)

In [78]:
d

      0   1   2   3   4   5
a 1  85  83  40  69  91   2
  2  54  85  45  74  18   5
  3  82  96  43  60  10  22
b 4   9  98  47  61   8  97
  5  35  40  66  47  85  32
  6  91  67  98  53  84  72

In [79]:
d.loc['a']

    0   1   2   3   4   5
1  85  83  40  69  91   2
2  54  85  45  74  18   5
3  82  96  43  60  10  22

In [80]:
d.loc['b']

    0   1   2   3   4   5
4   9  98  47  61   8  97
5  35  40  66  47  85  32
6  91  67  98  53  84  72

## Manejo de datos faltantes

In [81]:
a = np.arange(1,21).astype(float).reshape(5,4)

In [82]:
a

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6.,  7.,  8.],
       [ 9., 10., 11., 12.],
       [13., 14., 15., 16.],
       [17., 18., 19., 20.]])

In [83]:

a[(1,2,3),(0,1,2)]=np.nan
a[(2,3),(0,1)]=np.nan
a[3:4,0:1]=np.nan
a[4:5]=np.nan

In [84]:
a

array([[ 1.,  2.,  3.,  4.],
       [nan,  6.,  7.,  8.],
       [nan, nan, 11., 12.],
       [nan, nan, nan, 16.],
       [nan, nan, nan, nan]])

In [85]:
d=pd.DataFrame(a)

In [86]:
d

     0    1     2     3
0  1.0  2.0   3.0   4.0
1  NaN  6.0   7.0   8.0
2  NaN  NaN  11.0  12.0
3  NaN  NaN   NaN  16.0
4  NaN  NaN   NaN   NaN

In [87]:
d.dropna(subset=[3])

     0    1     2     3
0  1.0  2.0   3.0   4.0
1  NaN  6.0   7.0   8.0
2  NaN  NaN  11.0  12.0
3  NaN  NaN   NaN  16.0

In [88]:
d.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [89]:
d.dropna(1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [90]:
d.dropna(thresh=2)

     0    1     2     3
0  1.0  2.0   3.0   4.0
1  NaN  6.0   7.0   8.0
2  NaN  NaN  11.0  12.0

In [91]:
d.fillna('100')

     0    1    2    3
0    1    2    3    4
1  100    6    7    8
2  100  100   11   12
3  100  100  100   16
4  100  100  100  100

In [92]:
d[3].fillna(d[3].mean())

0     4.0
1     8.0
2    12.0
3    16.0
4    10.0
Name: 3, dtype: float64

### Groupby

In [93]:
d = pd.DataFrame()
d['letras'] = ['A','B', 'C', 'A','B', 'C']
d['valor1'] = np.random.randint(0,10,6)
d['valor2'] = np.random.randint(0,10,6)
d['valor3'] = np.random.randint(0,10,6)

In [94]:
d

  letras  valor1  valor2  valor3
0      A       9       3       9
1      B       1       2       8
2      C       2       8       6
3      A       9       1       0
4      B       5       7       9
5      C       8       4       9

In [95]:
g = d.groupby('letras')

In [96]:
g.mean()

        valor1  valor2  valor3
letras
A          9.0     2.0     4.5
B          3.0     4.5     8.5
C          5.0     6.0     7.5

In [97]:
g.std()

          valor1    valor2    valor3
letras
A       0.000000  1.414214  6.363961
B       2.828427  3.535534  0.707107
C       4.242641  2.828427  2.121320

In [98]:
g.min()

        valor1  valor2  valor3
letras
A            9       1       0
B            1       2       8
C            2       4       6

In [99]:
g.max()

        valor1  valor2  valor3
letras
A            9       3       9
B            5       7       9
C            8       8       9

In [100]:
g.count()

        valor1  valor2  valor3
letras
A            2       2       2
B            2       2       2
C            2       2       2

In [101]:
g.describe()

       valor1                                         valor2       ...        \
        count mean       std  min  25%  50%  75%  max  count mean  ...   75%
letras                                                             ...
A         2.0  9.0  0.000000  9.0  9.0  9.0  9.0  9.0    2.0  2.0  ...  2.50
B         2.0  3.0  2.828427  1.0  2.0  3.0  4.0  5.0    2.0  4.5  ...  5.75
C         2.0  5.0  4.242641  2.0  3.5  5.0  6.5  8.0    2.0  6.0  ...  7.00

            valor3
        max  count mean       std  min   25%  50%   75%  max
letras
A       3.0    2.0  4.5  6.363961  0.0  2.25  4.5  6.75  9.0
B       7.0    2.0  8.5  0.707107  8.0  8.25  8.5  8.75  9.0
C       8.0    2.0  7.5  2.121320  6.0  6.75  7.5  8.25  9.0

[3 rows x 24 columns]

## Union

In [102]:
df1 = pd.DataFrame(np.arange(1,21).reshape(5,4), columns = ['columna1', 'columna2', 'columna3', 'columna4'])
df2 = pd.DataFrame(np.arange(21,41).reshape(5,4), index = [5,6,7,8,9], columns = ['columna1', 'columna2', 'columna3', 'columna4'])
df3 = pd.DataFrame(np.arange(41,61).reshape(5,4), index = [10,11,12,13,14], columns = ['columna1', 'columna2', 'columna3', 'columna4'])

In [103]:
df1

   columna1  columna2  columna3  columna4
0         1         2         3         4
1         5         6         7         8
2         9        10        11        12
3        13        14        15        16
4        17        18        19        20

In [104]:
df2

   columna1  columna2  columna3  columna4
5        21        22        23        24
6        25        26        27        28
7        29        30        31        32
8        33        34        35        36
9        37        38        39        40

In [105]:
df3

    columna1  columna2  columna3  columna4
10        41        42        43        44
11        45        46        47        48
12        49        50        51        52
13        53        54        55        56
14        57        58        59        60

### Concat

In [106]:
pd.concat([df1,df2,df3])

    columna1  columna2  columna3  columna4
0          1         2         3         4
1          5         6         7         8
2          9        10        11        12
3         13        14        15        16
4         17        18        19        20
5         21        22        23        24
6         25        26        27        28
7         29        30        31        32
8         33        34        35        36
9         37        38        39        40
10        41        42        43        44
11        45        46        47        48
12        49        50        51        52
13        53        54        55        56
14        57        58        59        60

In [107]:
pd.concat([df1,df2,df3], axis= 1)

,columna1,columna2,columna3,columna4,columna1,columna2,columna3,columna4,columna1,columna2,columna3,columna4
0,1.0,2.0,3.0,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5.0,6.0,7.0,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,9.0,10.0,11.0,12.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,13.0,14.0,15.0,16.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,17.0,18.0,19.0,20.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,21.0,22.0,23.0,24.0,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,25.0,26.0,27.0,28.0,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,29.0,30.0,31.0,32.0,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,33.0,34.0,35.0,36.0,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,37.0,38.0,39.0,40.0,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,41.0,42.0,43.0,44.0
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,45.0,46.0,47.0,48.0
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,49.0,50.0,51.0,52.0
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,53.0,54.0,55.0,56.0
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,57.0,58.0,59.0,60.0

In [108]:
df1a = df1.copy()
df2a = df2.copy()
df3a = df3.copy()
df1a.index = [1,2,3,4,5]
df2a.index = [1,2,3,4,5]
df3a.index = [1,2,3,4,5]

In [109]:
df1a

   columna1  columna2  columna3  columna4
1         1         2         3         4
2         5         6         7         8
3         9        10        11        12
4        13        14        15        16
5        17        18        19        20

In [110]:
df2a

   columna1  columna2  columna3  columna4
1        21        22        23        24
2        25        26        27        28
3        29        30        31        32
4        33        34        35        36
5        37        38        39        40

In [111]:
pd.concat([df1a,df2a,df3a], axis= 1)

,columna1,columna2,columna3,columna4,columna1,columna2,columna3,columna4,columna1,columna2,columna3,columna4
1,1,2,3,4,21,22,23,24,41,42,43,44
2,5,6,7,8,25,26,27,28,45,46,47,48
3,9,10,11,12,29,30,31,32,49,50,51,52
4,13,14,15,16,33,34,35,36,53,54,55,56
5,17,18,19,20,37,38,39,40,57,58,59,60

### Merge

In [112]:
df1

   columna1  columna2  columna3  columna4
0         1         2         3         4
1         5         6         7         8
2         9        10        11        12
3        13        14        15        16
4        17        18        19        20

In [113]:
df1['columna4'] = ['a', 'b', 'c', 'd', 'e']
df2['columna4'] = ['a', 'b', 'c', 'd', 'e']
df1.columns = ['A', 'B', 'C', 'comun']
df2.columns = ['D', 'E', 'F', 'comun']

In [114]:
df1

    A   B   C comun
0   1   2   3     a
1   5   6   7     b
2   9  10  11     c
3  13  14  15     d
4  17  18  19     e

In [115]:
df2

    D   E   F comun
5  21  22  23     a
6  25  26  27     b
7  29  30  31     c
8  33  34  35     d
9  37  38  39     e

In [116]:
pd.merge(df1,df2, on='comun')

    A   B   C comun   D   E   F
0   1   2   3     a  21  22  23
1   5   6   7     b  25  26  27
2   9  10  11     c  29  30  31
3  13  14  15     d  33  34  35
4  17  18  19     e  37  38  39

In [117]:
df1

    A   B   C comun
0   1   2   3     a
1   5   6   7     b
2   9  10  11     c
3  13  14  15     d
4  17  18  19     e

In [118]:
df1 = pd.DataFrame(np.arange(0,18).reshape(6,3))
df2 = pd.DataFrame(np.arange(18,36).reshape(6,3))
df1.columns = ['A', 'B', 'C']
df2.columns = ['D', 'E', 'F']
df1['comun'] = ['a', 'b', 'c', 'd', 'e', 'f']
df2['comun'] = ['d', 'e', 'f', 'g', 'h', 'i']

In [119]:
df2

    D   E   F comun
0  18  19  20     d
1  21  22  23     e
2  24  25  26     f
3  27  28  29     g
4  30  31  32     h
5  33  34  35     i

In [120]:
pd.merge(df1,df2, on='comun')

    A   B   C comun   D   E   F
0   9  10  11     d  18  19  20
1  12  13  14     e  21  22  23
2  15  16  17     f  24  25  26

In [121]:
pd.merge(df1,df2, on='comun', how = 'inner')

    A   B   C comun   D   E   F
0   9  10  11     d  18  19  20
1  12  13  14     e  21  22  23
2  15  16  17     f  24  25  26

In [122]:
pd.merge(df1,df2, on='comun', how = 'outer')

      A     B     C comun     D     E     F
0   0.0   1.0   2.0     a   NaN   NaN   NaN
1   3.0   4.0   5.0     b   NaN   NaN   NaN
2   6.0   7.0   8.0     c   NaN   NaN   NaN
3   9.0  10.0  11.0     d  18.0  19.0  20.0
4  12.0  13.0  14.0     e  21.0  22.0  23.0
5  15.0  16.0  17.0     f  24.0  25.0  26.0
6   NaN   NaN   NaN     g  27.0  28.0  29.0
7   NaN   NaN   NaN     h  30.0  31.0  32.0
8   NaN   NaN   NaN     i  33.0  34.0  35.0

In [123]:
pd.merge(df1,df2, on='comun', how = 'left')

    A   B   C comun     D     E     F
0   0   1   2     a   NaN   NaN   NaN
1   3   4   5     b   NaN   NaN   NaN
2   6   7   8     c   NaN   NaN   NaN
3   9  10  11     d  18.0  19.0  20.0
4  12  13  14     e  21.0  22.0  23.0
5  15  16  17     f  24.0  25.0  26.0

In [124]:
pd.merge(df1,df2, on='comun', how = 'right')

      A     B     C comun   D   E   F
0   9.0  10.0  11.0     d  18  19  20
1  12.0  13.0  14.0     e  21  22  23
2  15.0  16.0  17.0     f  24  25  26
3   NaN   NaN   NaN     g  27  28  29
4   NaN   NaN   NaN     h  30  31  32
5   NaN   NaN   NaN     i  33  34  35

### Join

In [125]:
df1 = pd.DataFrame(np.arange(0,18).reshape(6,3), [1,2,3,4,5,6], ['A', 'B', 'C'])
df2 = pd.DataFrame(np.arange(18,36).reshape(6,3), [4,5,6,7,8,9], ['D', 'E', 'F'])
df1

    A   B   C
1   0   1   2
2   3   4   5
3   6   7   8
4   9  10  11
5  12  13  14
6  15  16  17

In [126]:
df2

    D   E   F
4  18  19  20
5  21  22  23
6  24  25  26
7  27  28  29
8  30  31  32
9  33  34  35

In [127]:
df1.join(df2)

    A   B   C     D     E     F
1   0   1   2   NaN   NaN   NaN
2   3   4   5   NaN   NaN   NaN
3   6   7   8   NaN   NaN   NaN
4   9  10  11  18.0  19.0  20.0
5  12  13  14  21.0  22.0  23.0
6  15  16  17  24.0  25.0  26.0

In [128]:
df1.join(df2, how = 'outer')

      A     B     C     D     E     F
1   0.0   1.0   2.0   NaN   NaN   NaN
2   3.0   4.0   5.0   NaN   NaN   NaN
3   6.0   7.0   8.0   NaN   NaN   NaN
4   9.0  10.0  11.0  18.0  19.0  20.0
5  12.0  13.0  14.0  21.0  22.0  23.0
6  15.0  16.0  17.0  24.0  25.0  26.0
7   NaN   NaN   NaN  27.0  28.0  29.0
8   NaN   NaN   NaN  30.0  31.0  32.0
9   NaN   NaN   NaN  33.0  34.0  35.0

## Importar Datos

In [129]:
import os

In [130]:
# CSV
os.getcwd()
df = pd.read_csv(os.getcwd()+'//data//drinks.csv')

In [131]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [132]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [133]:
df['total_litres_of_pure_alcohol'].unique()

array([ 0. ,  4.9,  0.7, 12.4,  5.9,  8.3,  3.8, 10.4,  9.7,  1.3,  6.3,
        2. , 14.4, 10.5,  6.8,  1.1,  0.4,  4.6,  5.4,  7.2,  0.6, 10.3,
        4.3,  4. ,  2.2,  5.8,  8.2,  1.8,  7.6,  5. ,  4.2,  0.1,  1.7,
        4.4, 10.2, 11.8,  2.3,  6.6,  6.2,  0.2,  0.5,  9.5, 10. ,  8.9,
        2.4, 11.3, 11.9,  2.5,  7.1,  3. , 11.4,  6.5,  3.4,  7. ,  1. ,
        1.9,  2.8,  3.1, 12.9,  0.8,  1.5,  0.3,  2.6,  5.5,  9.4,  9.3,
        3.5,  9.1,  6.7,  6.9,  7.3,  6.1, 10.9, 11. ,  0.9,  9.8, 11.5,
        7.7, 10.1,  9.6,  4.1, 10.6,  1.2,  5.6,  4.7,  6.4,  3.9,  1.4,
        5.7,  8.7])

In [134]:
df['total_litres_of_pure_alcohol'].nunique()

90

In [135]:
df['total_litres_of_pure_alcohol'].value_counts()

0.0    13
0.1     7
2.2     6
6.3     5
6.6     4
       ..
4.4     1
3.1     1
9.8     1
1.4     1
3.9     1
Name: total_litres_of_pure_alcohol, Length: 90, dtype: int64

In [136]:
df['total_litres_of_pure_alcohol'].sum()

910.4000000000001

In [137]:
def a_mayusculas(a):
    return a.upper()

In [138]:
df['country'].apply(a_mayusculas)

0      AFGHANISTAN
1          ALBANIA
2          ALGERIA
3          ANDORRA
4           ANGOLA
          ...
188      VENEZUELA
189        VIETNAM
190          YEMEN
191         ZAMBIA
192       ZIMBABWE
Name: country, Length: 193, dtype: object

In [139]:
df.sort_values('total_litres_of_pure_alcohol')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
147,San Marino,0,0,0,0.0
128,Pakistan,0,0,0,0.0
46,North Korea,0,0,0,0.0
13,Bangladesh,0,0,0,0.0
...,...,...,...,...,...
45,Czech Republic,361,170,134,11.8
68,Grenada,199,438,28,11.9
3,Andorra,245,138,312,12.4
98,Lithuania,343,244,56,12.9
15,Belarus,142,373,42,14.4

In [140]:
d = df.sort_values('total_litres_of_pure_alcohol', ascending=False)

In [141]:
d

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
15,Belarus,142,373,42,14.4
98,Lithuania,343,244,56,12.9
3,Andorra,245,138,312,12.4
68,Grenada,199,438,28,11.9
45,Czech Republic,361,170,134,11.8
...,...,...,...,...,...
79,Iran,0,0,0,0.0
90,Kuwait,0,0,0,0.0
128,Pakistan,0,0,0,0.0
97,Libya,0,0,0,0.0
0,Afghanistan,0,0,0,0.0

In [142]:
df.to_excel(os.getcwd()+'//data//drinks.xlsx', index = False)

In [143]:
d.to_csv(os.getcwd()+'//data//drinks_in_order.csv', index = False)

In [144]:
#Excel

d = pd.read_excel(os.getcwd()+'//data//drinks.xlsx')

In [145]:
d

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [146]:
d.to_excel(os.getcwd()+'//data//drinks_copy_excel.xlsx', index = False)